tangguocheng/stm32f10x/RCU_YS_with_iap/src/task/task_485.c
#include "stm32f10x.h"
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "bsp_uart1.h"
#include "CRC16.h"
#include "bsp_board_gpio.h"
#include "task_485.h"
#include "bsp_delay.h"

static u8 current_protocol = WK8001_PROTOCOL;           // –≠“È«–ªª
static u8 data_idx = 0;
static QueueHandle_t  send_485_queue = NULL;
static QueueHandle_t  receive_485_queue = NULL;
static u8 time_scheduler_start = 0;
static u16 time_scheduler_time = 0;
static u8 wk8001_time_start = 0;
static u16 wk8001_time_cnt = 0;
static u8 wk8001_time_start_2 = 0;
static u16 wk8001_time_cnt_2 = 0;
static u8 light_state_word = 0;
static u8 read_state_word = 0;
static u8 sleep_state_word = 0;
static u8 cozy_state_word = 0;
volatile u8 rs485_data_in = 0;
volatile u8 data_01 = 0;
volatile u8 data_03 = 0;
volatile u8 data_05 = 0;
volatile u8 data_02 = 0;
volatile u8 data_04 = 0;
volatile u8 data_06 = 0;
static u8 PA5_enable = 1;
struct portocol_data_frame {
        u8 use;
        u8 pro_id;
        u8 data_len;
        u8 data[25];
};

#define SEND_FRAME_LEN 30

static struct portocol_data_frame protocol_data_wait_sent[SEND_FRAME_LEN];

#define RECV_FRAME_LEN 20

static struct portocol_data_frame protocol_data_receive[RECV_FRAME_LEN];

static inline u8 get_avalid_frame(struct portocol_data_frame* frame,u8 frame_len)
{
        u8 i;
        for (i = 0; i < frame_len; i++ )
                if (!frame[i].use)
                        break;

        return (( i < frame_len) ?  i : 0);
}

BaseType_t send_queue_item(u8 from_isr,struct portocol_data_frame **protocol_data)
{
        void *data = protocol_data;
        if (send_485_queue == NULL)
                return pdFALSE;

        BaseType_t xHigherPriorityTaskWoken;

        if (from_isr)
                xQueueSendFromISR(send_485_queue, &data, &xHigherPriorityTaskWoken);
        else
                xQueueSend(send_485_queue, &data, 0);

        return( xHigherPriorityTaskWoken);
}


void send_protocol_data(struct portocol_data_frame * protocol_data)
{
        delay_nms(10);
        GPIO_SetBits(GPIOA,GPIO_Pin_8);
        delay_nms(2);
        for (u8 i = 0; i < protocol_data->data_len; i++)
                Uart1_send_data(protocol_data->data[i]);

        delay_nms(1);
        GPIO_ResetBits(GPIOA, GPIO_Pin_8);

        protocol_data->use = 0;

}

void key_0x13_delay_proc(void);
void key_0x14_delay_proc(void);
void key_0x16_delay_proc(void);

static u8 time_scheduler_flag = 0;
static u8 wk8001_flag_1 = 0;
static u8 wk8001_flag_2 = 0;
void time_scheduler(void)
{
//        if (time_scheduler_time) {
//                time_scheduler_flag = 1;
//                time_scheduler_time--;
//        }

//        if ((time_scheduler_start == 1) && (time_scheduler_time == 0) && (time_scheduler_flag == 1)) {
//                time_scheduler_flag = 0;
//                time_scheduler_start = 0;
//                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
//                protocol_data_wait_sent[idx].use = 1;
//                u8* protocol_data = protocol_data_wait_sent[idx].data;
//                protocol_data[0] = 0xd8;
//                data_04 = data_04 & (~BIT2);
//                protocol_data[3] = data_02;
//                protocol_data[5] = data_04;
//                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
//                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
//                                   protocol_data[6] ;

//                protocol_data_wait_sent[idx].data_len = 8;
//                void* ptr = &protocol_data_wait_sent[idx];
//                send_queue_item(1,ptr);
//        }
//        
//        if (wk8001_time_cnt) {
//                wk8001_flag_1 = 1;
//                wk8001_time_cnt--;
//        }
//        
//        if (wk8001_time_cnt == 0 && (wk8001_flag_1 == 1)) {
//                wk8001_flag_1 = 0;
//                if (wk8001_time_start & BIT1) {
//                        wk8001_time_start &= ~BIT1;
//                        RL_OFF(11);RL_OFF(12);RL_OFF(13);
//                } else if (wk8001_time_start & BIT2){
//                        wk8001_time_start &= ~BIT2;
//                        RL_ON(11);RL_OFF(12);RL_OFF(13);
//                } else if (wk8001_time_start & BIT3){
//                        wk8001_time_start &= ~BIT3;
//                        RL_OFF(11);RL_ON(12);RL_OFF(13);
//                } else if (wk8001_time_start & BIT4){
//                        wk8001_time_start &= ~BIT4;
//                        RL_OFF(11);RL_OFF(12);RL_ON(13);
//                }
//        }
//        
//        if (wk8001_time_cnt_2) {
//                wk8001_flag_2 = 1;
//                wk8001_time_cnt_2--;
//        }
//        
//        if (wk8001_time_cnt_2 == 0 && (wk8001_flag_2 == 1)) {
//                wk8001_flag_2 = 0;
//                if (wk8001_time_start_2 & BIT1) {
//                        RL_ON(11);RL_OFF(12);RL_OFF(13);
//                } else if (wk8001_time_start_2 & BIT2){
//                        RL_OFF(11);RL_OFF(12);RL_ON(13);
//                } else if (wk8001_time_start_2 & BIT3){
//                        RL_OFF(11);RL_OFF(12);RL_ON(13);
//                }
//        }        
//        
        key_0x13_delay_proc();
        key_0x14_delay_proc();
}

static u8 wk_data[14] = {0x01,0x01,0x02,0x00,0x01,0x19,0x19,0x10,0x10,0x10,0x10,0x10,0x10,0x10};
void copy_wk_data(u8* des)
{
        for (u8 i = 0; i < 14; i ++)
                des[i] = wk_data[i];
}

void update_wk_data(u8* src)
{
        for (u8 i = 0; i < 14; i ++)
                wk_data[i] = src[i];
}

void device_poll(void)
{
        if (current_protocol == WK8001_PROTOCOL) {
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;

                protocol_data[0] = 0x41;protocol_data[1] = 0x43;protocol_data[2] = 0x54;
                protocol_data[3] = 0x11;
                
                copy_wk_data(&protocol_data[4]);
                
                crc16_cal(&protocol_data[19], &protocol_data[18], &protocol_data[3], 15);

                protocol_data_wait_sent[idx].data_len = 20;
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);

        } else if (current_protocol == SHANGHUI_PROTOCOL) {
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;

                protocol_data[0] = 0x74;protocol_data[1] = 0xAA;protocol_data[2] = 0xDE;

                protocol_data_wait_sent[idx].data_len = 3;
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
}


static u8 receive_idx = 0;

void receive_protocol_data(u8 data)
{
        rs485_data_in = 1;
        if (current_protocol == WK8001_PROTOCOL) {
                protocol_data_receive[receive_idx].data[data_idx] = data;
                data_idx++;
                if (protocol_data_receive[receive_idx].data[0] != 0x41) {
                        data_idx = 0;
                        return;
                } else if (data_idx >= 17) {
                        u8 high_byte,low_byte;
                        data_idx = 0;
                        crc16_cal(&high_byte, &low_byte, &protocol_data_receive[receive_idx].data[3], 12);
//                        if ((high_byte == protocol_data_receive[receive_idx].data[16]) && (low_byte == protocol_data_receive[receive_idx].data[15])) {
                        if ((0x43 == protocol_data_receive[receive_idx].data[1]) && (0x54 == protocol_data_receive[receive_idx].data[2])) {

                                protocol_data_receive[receive_idx].use = 1;
                                protocol_data_receive[receive_idx].pro_id = WK8001_PROTOCOL;
                                void* ptr = &protocol_data_receive[receive_idx];
                                BaseType_t task_woken = pdFALSE;
                                xQueueSendFromISR( receive_485_queue, &ptr, &task_woken );
                                portYIELD_FROM_ISR(task_woken);
                        }
                        receive_idx = get_avalid_frame(protocol_data_receive,RECV_FRAME_LEN);
                }
        } else if (current_protocol == SHANGHUI_PROTOCOL) {
                protocol_data_receive[receive_idx].data[data_idx] = data;
                data_idx++;
                if ((protocol_data_receive[receive_idx].data[0] < 0x10) || (protocol_data_receive[receive_idx].data[0] > 0x73)) {
                        data_idx = 0;
                        return ;
                }

                if (data_idx >= 3) {
                        data_idx = 0;
                        if (protocol_data_receive[receive_idx].data[2] == (protocol_data_receive[receive_idx].data[0] ^ protocol_data_receive[receive_idx].data[1])) {
                                protocol_data_receive[receive_idx].use = 1;
                                protocol_data_receive[receive_idx].pro_id = SHANGHUI_PROTOCOL;
                                void* ptr = &protocol_data_receive[receive_idx];
                                BaseType_t task_woken = pdFALSE;
                                xQueueSendFromISR( receive_485_queue, &ptr, &task_woken );
                                portYIELD_FROM_ISR(task_woken);
                        }

