tangguocheng/stm32f10x/RCU_YS_with_iap/src/task/task_485.c
                        receive_idx = get_avalid_frame(protocol_data_receive,RECV_FRAME_LEN);
                }

        }
}

static u8 key_disable_0x11 = 0;
static u8 key_disable_0x12 = 0;
static u8 key_disable_0x13 = 0;
static u8 key_disable_0x14 = 0;
static u8 key_disable_0x15 = 0;
static u8 key_disable_0x16 = 0;

#define KEY_0x12    BIT1
#define KEY_0x14    BIT2
#define KEY_wkq     BIT3
void gpio_input_process(void)
{
        static u8 first = 1;
        static u8 last_PD12 = 3,last_PA4 = 3,last_PA5 = 3;
        u8 PD12 = GPIO_ReadInputDataBit(GPIOD,GPIO_Pin_12);
        u8 PA4 = GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_4);
        u8 PA5 = GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_5);
        u8 PA7 = GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_7);
        BaseType_t rtl = pdFALSE;

        if (first) {
                first = 0;
                last_PA4 = PA4;last_PA5 = PA5;
                return;
        }

        static u16 delay_off_time_D12 = 0;
        static u8 start_delay_D12 = 0;

        if (PD12 != last_PD12) {
                last_PD12 = PD12;
                if ( PD12 == Bit_RESET ) {
                        RL_ON(1);RL_ON(2);RL_ON(7);RL_ON(10);RL_ON(11);
                        GPIO_SetBits(GPIOE,GPIO_Pin_0);
                        RL_ON(14);RL_ON(16);
                        start_delay_D12 = BIT1;
                        delay_off_time_D12 = 2000;
                                             
                } else if (PD12 == Bit_SET) {
                        start_delay_D12 = BIT2;
                        delay_off_time_D12 = 60000;
                        RL_OFF(14);RL_OFF(15);RL_OFF(16);RL_OFF(17);
                }
        }

        if (delay_off_time_D12)
                delay_off_time_D12--;
        
        if ((delay_off_time_D12 == 58000) && (start_delay_D12 == BIT2)) {
                RL_ON(15);RL_ON(17);      
        } else if ((delay_off_time_D12 == 56000) && (start_delay_D12 == BIT2)) {
                RL_OFF(15);RL_OFF(17);
        }
                
        if ((start_delay_D12 != 0) && (delay_off_time_D12 == 0)) {
                if (start_delay_D12 == BIT1) {
                        RL_OFF(14);RL_OFF(16);
                        start_delay_D12 = 0;
                } else if (start_delay_D12 == BIT2){
                        RL_OFF(1);RL_OFF(6);RL_OFF(10);
                        RL_OFF(2);RL_OFF(7);RL_OFF(11);
                        RL_OFF(3);RL_OFF(8);RL_OFF(12);
                        RL_OFF(4);RL_OFF(9);RL_OFF(13);
                        RL_OFF(5);GPIO_ResetBits(GPIOE,GPIO_Pin_0);                                             
                }              
        }


        static u16 delay_off_time_A4 = 0;
        static u8 start_delay_A4 = 0;
        if ((PA4 != last_PA4)) {
                last_PA4 = PA4;
                if ( (PD12 == Bit_SET) && (PA4 == Bit_RESET)) {
                        start_delay_A4 = 1;
                        delay_off_time_A4 = 60000;
                        RL_ON(2);                        
                }
        }

        if (delay_off_time_A4)
                delay_off_time_A4--;

        if ((start_delay_A4 == 1) && (delay_off_time_A4 == 0)) {
                start_delay_A4 = 0;
                RL_OFF(2);               
        }

        static u8 start_delay_A5 = 0;
        static u16 delay_off_time_A5 = 0;

        if (PD12 == Bit_RESET)
                PA5_enable = 1;
        else if (PD12 == Bit_SET)
                PA5_enable = 0;
                
        if (PA5 != last_PA5) {
                last_PA5 = PA5;
                if ( (PA5 == Bit_RESET) && PA5_enable) {
                        start_delay_A5 = 1;
                        delay_off_time_A5 = 2000;
                        IO_OUTPUT9_ON();
                }
        }

        if (delay_off_time_A5)
                delay_off_time_A5--;

        if ((start_delay_A5 == 1) && (delay_off_time_A5 == 0)) {
                start_delay_A5 = 0;
                IO_OUTPUT9_OFF();
        }

        portYIELD_FROM_ISR(rtl);
}

static u16 delay_cnt = 0;
void task_485_poll(void* param)
{
        (void)param;
        while(1) {
                vTaskDelay(10 / portTICK_PERIOD_MS);
                delay_cnt++;
                
                if ((delay_cnt % 3) == 0) {
                        current_protocol = SHANGHUI_PROTOCOL;
                        device_poll();
                } 
//                else
//                if (delay_cnt == 200) {
//                        current_protocol = WK8001_PROTOCOL;
//                        device_poll();
//                        vTaskDelay(90 / portTICK_PERIOD_MS);
//                        delay_cnt = 0;
//                }      
        }
}


void key_0x12(u8 rx_data)
{
        rx_data &= (~key_disable_0x12);
        if (rx_data & BIT1) {
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_3 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_3) : GPIO_SetBits(GPIOE,GPIO_Pin_3));
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_4 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_4) : GPIO_SetBits(GPIOE,GPIO_Pin_4));
                if (GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_3 )  == Bit_RESET) {                        
                        data_02 |= BIT1;
                        data_02 &= (~BIT2);
                        PA5_enable = 0;
                        GPIO_ResetBits(GPIOE,GPIO_Pin_1);
                        GPIO_ResetBits(GPIOE,GPIO_Pin_2);
                } else {
                        data_02 &= (~BIT1);
                        PA5_enable = 1;
                } 
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;              
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

