tangguocheng/stm32f10x/RCU_YS_with_iap/src/task/task_485.c
                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT2) {
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_1 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_1) : GPIO_SetBits(GPIOE,GPIO_Pin_1));
                ((GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_2 ) == Bit_SET) ? GPIO_ResetBits(GPIOE,GPIO_Pin_2) : GPIO_SetBits(GPIOE,GPIO_Pin_2));
                if (GPIO_ReadOutputDataBit(GPIOE,GPIO_Pin_1 )  == Bit_RESET) {                        
                        data_02 &= (~BIT2);
                } else {
                        data_02 &= (~BIT1);
                        data_02 |= (BIT2);
                        GPIO_ResetBits(GPIOE,GPIO_Pin_3);
                        GPIO_ResetBits(GPIOE,GPIO_Pin_4);
                } 

                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT3) {
                RL_TOGGLE(2);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
               
              
                if (RL_STATE(2)) {
                        data_02 |= BIT3;
                } else {
                        data_02 &= (~BIT4);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT4) {
                RL_TOGGLE(3);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
               
              
                if (RL_STATE(3)) {
                        data_02 |= BIT4;
                } else {
                        data_02 &= (~BIT4);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT5) {
                RL_TOGGLE(6);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
              
                if (RL_STATE(6)) {
                        data_02 |= BIT5;
                } else {
                        data_02 &= (~BIT5);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT6) {
                RL_TOGGLE(4);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
              
                if (RL_STATE(4)) {
                        data_02 |= BIT6;
                } else {
                        data_02 &= (~BIT6);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

