tangguocheng/stm32f10x/RCU_YS_with_iap/src/task/task_485.c
                        void* ptr = &protocol_data_wait_sent[idx];
                        send_queue_item(1,ptr);
                }
                 
                if (key_0x14_delay_flag == BIT3) {
                        key_0x13_delay_flag = 0;
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd8;
                        
                        data_04 &= (~BIT5);
                      
                        protocol_data[2] = data_01;
                        protocol_data[3] = data_02;
                        protocol_data[4] = data_03;
                        protocol_data[5] = data_04;
                        protocol_data[6] = data_05;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;
                        protocol_data_wait_sent[idx].data_len = 8;                                                   

                        void* ptr = &protocol_data_wait_sent[idx];
                        send_queue_item(1,ptr);
                }
                
                if (key_0x14_delay_flag == BIT4) {
                        key_0x13_delay_flag = 0;
                        u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                        protocol_data_wait_sent[idx].use = 1;
                        u8* protocol_data = protocol_data_wait_sent[idx].data;
                        protocol_data[0] = 0xd8;
                        
                        data_04 &= (~BIT6);
                      
                        protocol_data[2] = data_01;
                        protocol_data[3] = data_02;
                        protocol_data[4] = data_03;
                        protocol_data[5] = data_04;
                        protocol_data[6] = data_05;
                        protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                           protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                           protocol_data[6] ;
                        protocol_data_wait_sent[idx].data_len = 8;                                                   

                        void* ptr = &protocol_data_wait_sent[idx];
                        send_queue_item(1,ptr);
                }
        }
}

void key_0x14(u8 rx_data)
{
        rx_data &= (~key_disable_0x14);
        if (rx_data & BIT1) {
                RL_OFF(16);RL_ON(17);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
              
                data_04 |= BIT1;
                data_04 &= (~BIT2);
                
                key_0x14_delay_flag = BIT1;
                key_0x14_delay_time = 10000;
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);
        }
        
        if (rx_data & BIT2) {
                RL_ON(16);RL_OFF(17);

                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
                
                data_04 |= BIT2;
                data_04 &= (~BIT1);
                key_0x14_delay_flag = BIT2;
                key_0x14_delay_time = 10000;
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

                void* ptr = &protocol_data_wait_sent[idx];
                send_queue_item(0,ptr);  
        }
        
        if (rx_data & BIT3) {
                RL_TOGGLE(10);
                u8 idx = get_avalid_frame(protocol_data_wait_sent,SEND_FRAME_LEN);
                protocol_data_wait_sent[idx].use = 1;
                u8* protocol_data = protocol_data_wait_sent[idx].data;
                protocol_data[0] = 0xd8;
     
                if (RL_STATE(10)) {
                        data_04 |= BIT3;
                } else {
                        data_04 &= (~BIT3);
                }
                
                protocol_data[2] = data_01;
                protocol_data[3] = data_02;
                protocol_data[4] = data_03;
                protocol_data[5] = data_04;
                protocol_data[6] = data_05;
                protocol_data[7] = protocol_data[0] ^ protocol_data[1] ^ protocol_data[2] ^ 
                                   protocol_data[3] ^ protocol_data[4] ^ protocol_data[5] ^
                                   protocol_data[6] ;
                protocol_data_wait_sent[idx].data_len = 8;                                                   

